{
"ocid":["","A globally unique identifier for this Open Contracting Process. Composed of a publisher prefix and an identifier for the contracting process. For more information see the Open Contracting Identifier guidance",""],
"id":["","A unique identifier that identifies this release. A releaseID must be unique within a release-package and must not contain the # character.",""],
"date":[""," The date this information was first released, or published.",""],
"tag":["","One or more values from the releaseTag codelist. Tags may be used to filter release and the understand the kind of information that a release might contain.",""],
"initiationType":["","String specifying the type of initiation process used for this contract, taken from the initiationType codelist. Currently only tender is supported.",""],
"language":["","Specifies the default language of the data using either two-digit ISO 639-1, or extended BCP47 language tags. The use of two-letter codes from ISO 639-1 is strongly recommended.",""],
"relatedProcesses":["","A reference to a related contracting process: generally one preceeding or following on from the current process.",""],
"relatedProcesses-id":["","A local identifier for this relationship, unique within this array.",""],
"relatedProcesses-relationship":["","Specify the type of relationship using the related process codelist.",""],
"relatedProcesses-title":["","The title of the related process, where referencing an open contracting process, this field should match the tender/title field in the related process.",""],
"relatedProcesses-scheme":["","The identification scheme used by this cross-reference from the related process scheme codelist codelist. When cross-referencing information also published using OCDS, an Open Contracting ID (ocid) should be used.",""],
"relatedProcesses-identifier":["","The identifier of the related process. When cross-referencing information also published using OCDS, this should be the Open Contracting ID (ocid).",""],
"relatedProcesses-uri":["","A URI pointing to a machine-readable document, release or record package containing the identified related process.",""],
"parties":["","Information on the parties (organisations, economic operators and other participants) who are involved in the contracting process and their roles, e.g. buyer, procuring entity, supplier etc. Organization references elsewhere in the schema are used to refer back to this entries in this list.",""],
"parties-name":["","A common name for this organization or other participant in the contracting process. The identifier object provides an space for the formal legal name, and so this may either repeat that value, or could provide the common name by which this organization or entity is known. This field may also include details of the department or sub-unit involved in this contracting process.",""],
"parties-id":["","The ID used for cross-referencing to this party from other sections of the release. This field may be built with the following structure {identifier.scheme}-{identifier.id}(-{department-identifier}).",""],
"parties-identifier":["","The primary identifier for this organization or participant. Identifiers that uniquely pick out a legal entity should be preferred. Consult the organization identifier guidance for the preferred scheme and identifier to use.",""],
"parties-identifier-scheme":["","Organization identifiers be drawn from an existing identification scheme. This field is used to indicate the scheme or codelist in which the identifier will be found. This value should be drawn from the Organization Identifier Scheme.",""],
"parties-identifier-id":["","The identifier of the organization in the selected scheme.",""],
"parties-identifier-legalName":["","The legally registered name of the organization.",""],
"parties-identifier-uri":["","A URI to identify the organization, such as those provided by Open Corporates or some other relevant URI provider. This is not for listing the website of the organization: that can be done through the url field of the Organization contact point.",""],
"parties-additionalIdentifiers":["","A list of additional / supplemental identifiers for the organization or participant, using the organization identifier guidance. This could be used to provide an internally used identifier for this organization in addition to the primary legal entity identifier.",""],
"parties-additionalIdentifiers-scheme":["","Organization identifiers be drawn from an existing identification scheme. This field is used to indicate the scheme or codelist in which the identifier will be found. This value should be drawn from the Organization Identifier Scheme.",""],
"parties-additionalIdentifiers-id":["","The identifier of the organization in the selected scheme.",""],
"parties-additionalIdentifiers-legalName":["","The legally registered name of the organization.",""],
"parties-additionalIdentifiers-uri":["","A URI to identify the organization, such as those provided by Open Corporates or some other relevant URI provider. This is not for listing the website of the organization: that can be done through the url field of the Organization contact point.",""],
"parties-address":["","An address. This may be the legally registered address of the organization, or may be a correspondence address for this particular contracting process.",""],
"parties-address-streetAddress":["","The street address. For example, 1600 Amphitheatre Pkwy.",""],
"parties-address-locality":["","The locality. For example, Mountain View.",""],
"parties-address-region":["","The region. For example, CA.",""],
"parties-address-postalCode":["","The postal code. For example, 94043.",""],
"parties-address-countryName":["","The country name. For example, United States.",""],
"parties-contactPoint":["","An person, contact point or department to contact in relation to this contracting process.",""],
"parties-contactPoint-name":["","The name of the contact person, department, or contact point, for correspondence relating to this contracting process.",""],
"parties-contactPoint-email":["","The e-mail address of the contact point/person.",""],
"parties-contactPoint-telephone":["","The telephone number of the contact point/person. This should include the international dialling code.",""],
"parties-contactPoint-faxNumber":["","The fax number of the contact point/person. This should include the international dialling code.",""],
"parties-contactPoint-url":["","A web address for the contact point/person.",""],
"parties-roles":["","The parties’s role(s) in the contracting process. Role(s) should be taken from the partyRole codelist. Values from the provided codelist should be used wherever possible, though extended values can be provided if the codelist does not have a relevant code.",""],
"parties-details":["","Additional classification information about parties can be provided using partyDetail extensions that define particular properties and classification schemes.",""],
"buyer":["","The buyer is the entity whose budget will be used to purchase the goods. This may be different from the procuring agency who may be specified in the tender data.",""],
"buyer-name":["","field that repeats the name given in the parties section, provided for the convenience of users viewing the data, and to support detection of mistakes in cross-referencing.",""],
"buyer-id":["","used to cross-reference the entry in the parties section that contains full information on this organization or entity",""],
"buyer-identifier":["","",""],
"buyer-identifier-scheme":["","Organization identifiers be drawn from an existing identification scheme. This field is used to indicate the scheme or codelist in which the identifier will be found. This value should be drawn from the Organization Identifier Scheme.",""],
"buyer-identifier-id":["","The identifier of the organization in the selected scheme.",""],
"buyer-identifier-legalName":["","The legally registered name of the organization.",""],
"buyer-identifier-uri":["","A URI to identify the organization, such as those provided by Open Corporates or some other relevant URI provider. This is not for listing the website of the organization: that can be done through the url field of the Organization contact point.",""],
"planning":["","Information from the planning phase of the contracting process. Note that many other fields may be filled in a planning release, in the appropriate fields in other schema sections, these would likely be estimates at this stage e.g. totalValue in tender",""],
"planning-rationale":["","The rationale for the procurement provided in free text. More detail can be provided in an attached document.",""],
"planning-budget":["","This section contain information about the budget line, and associated projects, through which this contracting process is funded. It draws upon data model of the Budget Data Package, and should be used to cross-reference to more detailed information held using a Budget Data Package, or, where no linked Budget Data Package is available, to provide enough information to allow a user to manually or automatically cross-reference with another published source of budget and project information.",""],
"planning-budget-id":["","An identifier for the budget line item which provides funds for this contracting process. This identifier should be possible to cross-reference against the provided data source.",""],
"planning-budget-description":["","A short free text description of the budget source. May be used to provide the title of the budget line, or the programme used to fund this project.",""],
"planning-budget-amount":["","The value of the budget line item",""],
"planning-budget-amount-amount":["","Amount as a number.",""],
"planning-budget-amount-currency":["","The currency in 3-letter ISO 4217 format.",""],
"planning-budget-project":["","The name of the project that through which this contracting process is funded (if applicable). Some organizations maintain a registry of projects, and the data should use the name by which the project is known in that registry. No translation option is offered for this string, as translated values can be provided in third-party data, linked from the data source above.",""],
"planning-budget-projectID":["","An external identifier for the project that this contracting process forms part of, or is funded via (if applicable). Some organizations maintain a registry of projects, and the data should use the identifier from the relevant registry of projects.",""],
"planning-budget-uri":["","A URI pointing directly to a machine-readable record about the related budget or projects for this contracting process.",""],
"planning-documents":["","A list of documents related to the planning process.",""],
"planning-documents":["","Links to, or descriptions of, external documents can be attached at various locations within the standard. Documents may be supporting information, formal notices, downloadable forms, or any other kind of resource that should be made public as part of full open contracting.",""],
"planning-documents-id":["","A local, unique identifier for this document. This field is used to keep track of multiple revisions of a document through the compilation from release to record mechanism.",""],
"planning-documents-documentType":["","A classification of the document described taken from the documentType codelist. Values from the provided codelist should be used wherever possible, though extended values can be provided if the codelist does not have a relevant code.",""],
"planning-documents-title":["","The document title.",""],
"planning-documents-description":["","A short description of the document. We recommend descriptions do not exceed 250 words. In the event the document is not accessible online, the description field can be used to describe arrangements for obtaining a copy of the document.",""],
"planning-documents-url":["","direct link to the document or attachment. The server providing access to this document should be configured to correctly report the document mime type.",""],
"planning-documents-datePublished":["","The date on which the document was first published. This is particularly important for legally important documents such as notices of a tender.",""],
"planning-documents-dateModified":["","Date that the document was last modified",""],
"planning-documents-format":["","The format of the document taken from the IANA Media Types code list, with the addition of one extra value for 'offline/print', used when this document entry is being used to describe the offline publication of a document. Use values from the template column. Links to web pages should be tagged 'text/html'.",""],
"planning-documents-language":["","Specifies the language of the linked document using either two-digit ISO 639-1, or extended BCP47 language tags. The use of two-letter codes from ISO 639-1 is strongly recommended unless there is a clear user need for distinguishing the language subtype.",""],
"planning-milestones":["","A list of milestones associated with the planning stage.",""],
"planning-milestones-id":["","A local identifier for this milestone, unique within this block. This field is used to keep track of multiple revisions of a milestone through the compilation from release to record mechanism.",""],
"planning-milestones-title":["","Milestone title",""],
"planning-milestones-type":["","The type of milestone, drawn from an extended milestoneType codelist.",""],
"planning-milestones-description":["","A description of the milestone.",""],
"planning-milestones-code":["","Milestone codes can be used to track specific events that take place for a particular kind of contracting process. For example, a code of ‘approvalLetter’ could be used to allow applications to understand this milestone represents the date an approvalLetter is due or signed. Milestone codes is an open codelist, and codes should be agreed amoungst data producers and the applications using that data.",""],
"planning-milestones-dueDate":["","The date the milestone is due.",""],
"planning-milestones-dateMet":["","The date on which the milestone was met.",""],
"planning-milestones-dateModified":["","The date the milestone was last reviewed or modified and the status was altered or confirmed to still be correct.",""],
"planning-milestones-status":["","The status that was realized on the date provided in dateModified, drawn from the milestoneStatus codelist.",""],
"tender":["","Data regarding tender process - publicly inviting prospective contractors to submit bids for evaluation and selecting a winner or winners.",""],
"tender-id":["","An identifier for this tender process. This may be the same as the ocid, or may be drawn from an internally held identifier for this tender.",""],
"tender-title":["","Tender title",""],
"tender-description":["","Tender description",""],
"tender-status":["","The current status of the tender based on the tenderStatus codelist",""],
"tender-procurementMethod":["","Specify tendering method against the method codelist as per GPA definitions of Open, Selective, Limited",""],
"tender-procurementMethodDetails":["","Additional detail on the procurement method used. This field may be used to provide the local name of the particular procurement method used.",""],
"tender-mainProcurementCategory":["","The primary category describing the main object of this contracting process from the procurementCategory codelist. This is a closed codelist. Local classifications should be mapped to this list..",""],
"tender-additionalProcurementCategories":["","Any additional categories which describe the objects of this contracting process, from the extendedProcurementCategory codelist. This is an open codelist. Local categories can be included in this list.",""],
"tender-procurementMethodRationale":["","Rationale of procurement method, especially in the case of Limited tendering.",""],
"tender-awardCriteria":["","Specify the award criteria for the procurement, using the award criteria codelist",""],
"tender-awardCriteriaDetails":["","Any detailed or further information on the award or selection criteria.",""],
"tender-submissionMethod":["","Specify the method by which bids must be submitted, in person, written, or electronic auction. Using the submission method codelist",""],
"tender-submissionMethodDetails":["","Any detailed or further information on the submission method. This may include the address, e-mail address or online service to which bids should be submitted, and any special requirements to be followed for submissions.",""],
"tender-minValue":["","The minimum estimated value of the procurement. A negative value indicates that the contracting process may involve payments from the supplier to the buyer (commonly used in concession contracts).",""],
"tender-minValue-amount":["","Amount as a number.",""],
"tender-minValue-currency":["","The currency in 3-letter ISO 4217 format.",""],
"tender-value":["","The total upper estimated value of the procurement. A negative value indicates that the contracting process may involve payments from the supplier to the buyer (commonly used in concession contracts).",""],
"tender-value-amount":["","Amount as a number.",""],
"tender-value-currency":["","The currency in 3-letter ISO 4217 format.",""],
"tender-tenderPeriod":["","The period when the tender is open for submissions. The end date is the closing date for tender submissions.",""],
"tender-tenderPeriod-startDate":["","The start date for the period.",""],
"tender-tenderPeriod-endDate":["","The end date for the period.",""],
"tender-tenderPeriod-durationInDays":["","The period cannot be extended beyond this date. This field is optional, and can be used to express the maximum available data for extension or renewal of this period.",""],
"tender-tenderPeriod-maxExtentDate":["","The maximum duration of this period in days. A user interface may wish to collect or display this data in months or years as appropriate, but should convert it into days when completing this field. This field can be used when exact dates are not known. Where a startDate and endDate are given, this field is optional, and should reflect the difference between those two days. Where a startDate and maxExtentDate are given, this field is optional, and should reflect the diffence between startDate and maxExtentDate.",""],
"tender-enquiryPeriod":["","The period during which enquiries may be made and answered.",""],
"tender-enquiryPeriod-startDate":["","The start date for the period.",""],
"tender-enquiryPeriod-endDate":["","The end date for the period.",""],
"tender-enquiryPeriod-durationInDays":["","The period cannot be extended beyond this date. This field is optional, and can be used to express the maximum available data for extension or renewal of this period.",""],
"tender-enquiryPeriod-maxExtentDate":["","The maximum duration of this period in days. A user interface may wish to collect or display this data in months or years as appropriate, but should convert it into days when completing this field. This field can be used when exact dates are not known. Where a startDate and endDate are given, this field is optional, and should reflect the difference between those two days. Where a startDate and maxExtentDate are given, this field is optional, and should reflect the diffence between startDate and maxExtentDate.",""],
"tender-hasEnquiries":["","A Yes/No field to indicate whether enquiries were part of tender process.",""],
"tender-eligibilityCriteria":["","A description of any eligibility criteria for potential suppliers.",""],
"tender-awardPeriod":["","The date or period on which an award is anticipated to be made.",""],
"tender-awardPeriod-startDate":["","The start date for the period.",""],
"tender-awardPeriod-endDate":["","The end date for the period.",""],
"tender-awardPeriod-durationInDays":["","The period cannot be extended beyond this date. This field is optional, and can be used to express the maximum available data for extension or renewal of this period.",""],
"tender-awardPeriod-maxExtentDate":["","The maximum duration of this period in days. A user interface may wish to collect or display this data in months or years as appropriate, but should convert it into days when completing this field. This field can be used when exact dates are not known. Where a startDate and endDate are given, this field is optional, and should reflect the difference between those two days. Where a startDate and maxExtentDate are given, this field is optional, and should reflect the diffence between startDate and maxExtentDate.",""],
"tender-contractPeriod":["","The period over which the contract is estimated or required to be active. If the tender does not specify explicit dates, the duration field may be used.",""],
"tender-contractPeriod-startDate":["","The start date for the period.",""],
"tender-contractPeriod-endDate":["","The end date for the period.",""],
"tender-contractPeriod-durationInDays":["","The period cannot be extended beyond this date. This field is optional, and can be used to express the maximum available data for extension or renewal of this period.",""],
"tender-contractPeriod-maxExtentDate":["","The maximum duration of this period in days. A user interface may wish to collect or display this data in months or years as appropriate, but should convert it into days when completing this field. This field can be used when exact dates are not known. Where a startDate and endDate are given, this field is optional, and should reflect the difference between those two days. Where a startDate and maxExtentDate are given, this field is optional, and should reflect the diffence between startDate and maxExtentDate.",""],
"tender-items":["","The goods and services to be purchased, broken into line items wherever possible. Items should not be duplicated, but a quantity of 2 specified instead.",""],
"tender-items-id":["","A local identifier to reference and merge the items by. Must be unique within a given array of items.",""],
"tender-items-description":["","A description of the goods, services to be provided.",""],
"tender-items-classification":["","The primary classification for the item. See the itemClassificationScheme to identify preferred classification lists, including CPV and GSIN.",""],
"tender-items-classification-scheme":["","An classification should be drawn from an existing scheme or list of codes. This field is used to indicate the scheme/codelist from which the classification is drawn. For line item classifications, this value should represent an known Item Classification Scheme wherever possible.",""],
"tender-items-classification-id":["","The classification code drawn from the selected scheme.",""],
"tender-items-classification-description":["","A textual description or title for the code.",""],
"tender-items-classification-uri":["","A URI to identify the code. In the event individual URIs are not available for items in the identifier scheme this value should be left blank.",""],
"tender-items-additionalClassifications":["","An array of additional classifications for the item. See the itemClassificationScheme codelist for common options to use in OCDS. This may also be used to present codes from an internal classification scheme.",""],
"tender-items-additionalClassifications-scheme":["","An classification should be drawn from an existing scheme or list of codes. This field is used to indicate the scheme/codelist from which the classification is drawn. For line item classifications, this value should represent an known Item Classification Scheme wherever possible.",""],
"tender-items-additionalClassifications-id":["","The classification code drawn from the selected scheme.",""],
"tender-items-additionalClassifications-description":["","A textual description or title for the code.",""],
"tender-items-additionalClassifications-uri":["","A URI to identify the code. In the event individual URIs are not available for items in the identifier scheme this value should be left blank.",""],
"tender-items-quantity":["","The number of units required",""],
"tender-items-unit":["","Description of the unit which the good comes in e.g. hours, kilograms. Made up of a unit name, and the value of a single unit.",""],
"tender-items-unit-name":["","Name of the unit",""],
"tender-items-unit-scheme":["","The list from which units of measure identifiers are taken. This should be an entry from the options available in the unitClassificationScheme codelist. Use of the scheme ‘UNCEFACT’ for the UN/CEFACT Recommendation 20 list of ‘Codes for Units of Measure Used in International Trade’ is recommended, although other options are available.",""],
"tender-items-unit-id":["","The identifier from the codelist referenced in the scheme property. Check the codelist for details of how to find and use identifiers from the scheme in use.",""],
"tender-items-unit-uri":["","If the scheme used provide a machine-readable URI for this unit of measure, this can be given.",""],
"tender-items-unit-value":["","The monetary value of a single unit.",""],
"tender-items-unit-value-amount":["","Amount as a number.",""],
"tender-items-unit-value-currency":["","The currency in 3-letter ISO 4217 format.",""],
"tender-numberOfTenderers":["","The number of entities who submit a tender",""],
"tender-tenderers":["","An organization.",""],
"tender-tenderers-name":["","name field that repeats the name given in the parties section, provided for the convenience of users viewing the data, and to support detection of mistakes in cross-referencing.",""],
"tender-tenderers-id":["","id used to cross-reference the entry in the parties section that contains full information on this organization or entity",""],
"tender-tenderers-identifier":["","",""],
"tender-tenderers-identifier-scheme":["","Organization identifiers be drawn from an existing identification scheme. This field is used to indicate the scheme or codelist in which the identifier will be found. This value should be drawn from the Organization Identifier Scheme.",""],
"tender-tenderers-identifier-id":["","The identifier of the organization in the selected scheme.",""],
"tender-tenderers-identifier-legalName":["","The legally registered name of the organization.",""],
"tender-tenderers-identifier-uri":["","A URI to identify the organization, such as those provided by Open Corporates or some other relevant URI provider. This is not for listing the website of the organization: that can be done through the url field of the Organization contact point.",""],
"tender-procuringEntity":["","The entity managing the procurement. This may be different from the buyer who pays for, or uses, the items being procured.",""],
"tender-procuringEntity-name":["","name field that repeats the name given in the parties section, provided for the convenience of users viewing the data, and to support detection of mistakes in cross-referencing.",""],
"tender-procuringEntity-id":["","id used to cross-reference the entry in the parties section that contains full information on this organization or entity;",""],
"tender-procuringEntity-identifier":["","",""],
"tender-procuringEntity-identifier-scheme":["","Organization identifiers be drawn from an existing identification scheme. This field is used to indicate the scheme or codelist in which the identifier will be found. This value should be drawn from the Organization Identifier Scheme.",""],
"tender-procuringEntity-identifier-id":["","The identifier of the organization in the selected scheme.",""],
"tender-procuringEntity-identifier-legalName":["","The legally registered name of the organization.",""],
"tender-procuringEntity-identifier-uri":["","A URI to identify the organization, such as those provided by Open Corporates or some other relevant URI provider. This is not for listing the website of the organization: that can be done through the url field of the Organization contact point.",""],
"tender-documents":["","All documents and attachments related to the tender, including any notices. See the documentType codelist for details of potential documents to include.",""],
"tender-documents":["","Links to, or descriptions of, external documents can be attached at various locations within the standard. Documents may be supporting information, formal notices, downloadable forms, or any other kind of resource that should be made public as part of full open contracting.",""],
"tender-documents-id":["","A local, unique identifier for this document. This field is used to keep track of multiple revisions of a document through the compilation from release to record mechanism.",""],
"tender-documents-documentType":["","A classification of the document described taken from the documentType codelist. Values from the provided codelist should be used wherever possible, though extended values can be provided if the codelist does not have a relevant code.",""],
"tender-documents-title":["","The document title.",""],
"tender-documents-description":["","A short description of the document. We recommend descriptions do not exceed 250 words. In the event the document is not accessible online, the description field can be used to describe arrangements for obtaining a copy of the document.",""],
"tender-documents-url":["","direct link to the document or attachment. The server providing access to this document should be configured to correctly report the document mime type.",""],
"tender-documents-datePublished":["","The date on which the document was first published. This is particularly important for legally important documents such as notices of a tender.",""],
"tender-documents-dateModified":["","Date that the document was last modified",""],
"tender-documents-format":["","The format of the document taken from the IANA Media Types code list, with the addition of one extra value for 'offline/print', used when this document entry is being used to describe the offline publication of a document. Use values from the template column. Links to web pages should be tagged 'text/html'.",""],
"tender-documents-language":["","Specifies the language of the linked document using either two-digit ISO 639-1, or extended BCP47 language tags. The use of two-letter codes from ISO 639-1 is strongly recommended unless there is a clear user need for distinguishing the language subtype.",""],
"tender-milestones":["","A list of milestones associated with the tender.",""],
"tender-milestones-id":["","A local identifier for this milestone, unique within this block. This field is used to keep track of multiple revisions of a milestone through the compilation from release to record mechanism.",""],
"tender-milestones-title":["","Milestone title",""],
"tender-milestones-type":["","The type of milestone, drawn from an extended milestoneType codelist.",""],
"tender-milestones-description":["","A description of the milestone.",""],
"tender-milestones-code":["","Milestone codes can be used to track specific events that take place for a particular kind of contracting process. For example, a code of ‘approvalLetter’ could be used to allow applications to understand this milestone represents the date an approvalLetter is due or signed. Milestone codes is an open codelist, and codes should be agreed amoungst data producers and the applications using that data.",""],
"tender-milestones-dueDate":["","The date the milestone is due.",""],
"tender-milestones-dateMet":["","The date on which the milestone was met.",""],
"tender-milestones-dateModified":["","The date the milestone was last reviewed or modified and the status was altered or confirmed to still be correct.",""],
"tender-milestones-status":["","The status that was realized on the date provided in dateModified, drawn from the milestoneStatus codelist.",""],
"tender-amendments":["","The amendment block in each of tender, award and contract blocks provides the ability to explicitly declare changed fields, their former values, to provide an explanation for the change, and attach or reference relevant documentation.",""],
"tender-amendments-id":["","An identifier for this amendment: often the amendment number",""],
"tender-amendments-date":["","The data of this amendment.",""],
"tender-amendments-description":["","A free text, or semi-structured, description of the changes made in this amendment.",""],
"tender-amendments-amendsReleaseID":["","Provide the identifier (release.id) of the OCDS release (from this contracting process) that provides the values for this contracting process before the amendment was made.",""],
"tender-amendments-releaseID":["","Provide the identifier (release.id) of the OCDS release (from this contracting process) that provides the values for this contracting process after the amendment was made.",""],
"tender-amendments-rationale":["","An explanation for the amendment.",""],
"awards":["","Information from the award phase of the contracting process. There may be more than one award per contracting process e.g. because the contract is split amongst different providers, or because it is a standing offer.",""],
"awards":["","An award for the given procurement. There may be more than one award per contracting process e.g. because the contract is split amongst different providers, or because it is a standing offer.",""],
"awards-id":["","The identifier for this award. It must be unique and cannot change within the Open Contracting Process it is part of (defined by a single ocid). See the identifier guidance for further details.",""],
"awards-title":["","Award title",""],
"awards-description":["","Award description",""],
"awards-status":["","The current status of the award drawn from the awardStatus codelist",""],
"awards-date":["","The date of the contract award. This is usually the date on which a decision to award was made.",""],
"awards-value":["","The total value of this award. In the case of a framework contract this may be the total estimated lifetime value, or maximum value, of the agreement. There may be more than one award per procurement.",""],
"awards-value-amount":["","Amount as a number.",""],
"awards-value-currency":["","The currency in 3-letter ISO 4217 format.",""],
"awards-contractPeriod":["","The period for which the contract has been awarded.",""],
"awards-contractPeriod-startDate":["","The start date for the period.",""],
"awards-contractPeriod-endDate":["","The end date for the period.",""],
"awards-contractPeriod-durationInDays":["","The period cannot be extended beyond this date. This field is optional, and can be used to express the maximum available data for extension or renewal of this period.",""],
"awards-contractPeriod-maxExtentDate":["","The maximum duration of this period in days. A user interface may wish to collect or display this data in months or years as appropriate, but should convert it into days when completing this field. This field can be used when exact dates are not known. Where a startDate and endDate are given, this field is optional, and should reflect the difference between those two days. Where a startDate and maxExtentDate are given, this field is optional, and should reflect the diffence between startDate and maxExtentDate.",""],
"awards-suppliers":["","The suppliers awarded this award. If different suppliers have been awarded different items of values, these should be split into separate award blocks.",""],
"awards-suppliers-name":["","name field that repeats the name given in the parties section, provided for the convenience of users viewing the data, and to support detection of mistakes in cross-referencing",""],
"awards-suppliers-id":["","id used to cross-reference the entry in the parties section that contains full information on this organization or entity",""],
"awards-suppliers-identifier":["","",""],
"awards-suppliers-identifier-id":["","The identifier of the organization in the selected scheme.",""],
"awards-suppliers-identifier-scheme":["","Organization identifiers be drawn from an existing identification scheme. This field is used to indicate the scheme or codelist in which the identifier will be found. This value should be drawn from the Organization Identifier Scheme.",""],
"awards-suppliers-identifier-legalName":["","The legally registered name of the organization.",""],
"awards-suppliers-identifier-uri":["","A URI to identify the organization, such as those provided by Open Corporates or some other relevant URI provider. This is not for listing the website of the organization: that can be done through the url field of the Organization contact point.",""],
"awards-items":["","The goods and services awarded in this award, broken into line items wherever possible. Items should not be duplicated, but the quantity specified instead.",""],
"awards-items-id":["","A local identifier to reference and merge the items by. Must be unique within a given array of items.",""],
"awards-items-description":["","A description of the goods, services to be provided.",""],
"awards-items-classification":["","The primary classification for the item. See the itemClassificationScheme to identify preferred classification lists, including CPV and GSIN.",""],
"awards-items-classification-scheme":["","An classification should be drawn from an existing scheme or list of codes. This field is used to indicate the scheme/codelist from which the classification is drawn. For line item classifications, this value should represent an known Item Classification Scheme wherever possible.",""],
"awards-items-classification-id":["","The classification code drawn from the selected scheme.",""],
"awards-items-classification-description":["","A textual description or title for the code.",""],
"awards-items-classification-uri":["","A URI to identify the code. In the event individual URIs are not available for items in the identifier scheme this value should be left blank.",""],
"awards-items-additionalClassifications":["","An array of additional classifications for the item. See the itemClassificationScheme codelist for common options to use in OCDS. This may also be used to present codes from an internal classification scheme.",""],
"awards-items-additionalClassifications-scheme":["","An classification should be drawn from an existing scheme or list of codes. This field is used to indicate the scheme/codelist from which the classification is drawn. For line item classifications, this value should represent an known Item Classification Scheme wherever possible.",""],
"awards-items-additionalClassifications-id":["","The classification code drawn from the selected scheme.",""],
"awards-items-additionalClassifications-description":["","A textual description or title for the code.",""],
"awards-items-additionalClassifications-uri":["","A URI to identify the code. In the event individual URIs are not available for items in the identifier scheme this value should be left blank.",""],
"awards-items-unit-scheme":["","The list from which units of measure identifiers are taken. This should be an entry from the options available in the unitClassificationScheme codelist. Use of the scheme ‘UNCEFACT’ for the UN/CEFACT Recommendation 20 list of ‘Codes for Units of Measure Used in International Trade’ is recommended, although other options are available.",""],
"awards-items-unit-id":["","The identifier from the codelist referenced in the scheme property. Check the codelist for details of how to find and use identifiers from the scheme in use.",""],
"awards-items-unit-uri":["","If the scheme used provide a machine-readable URI for this unit of measure, this can be given.",""],
"awards-items-quantity":["","The number of units required",""],
"awards-items-unit":["","Description of the unit which the good comes in e.g. hours, kilograms. Made up of a unit name, and the value of a single unit.",""],
"awards-items-unit-name":["","Name of the unit",""],
"awards-items-unit-value":["","The monetary value of a single unit.",""],
"awards-items-unit-value-amount":["","Amount as a number.",""],
"awards-items-unit-value-currency":["","The currency in 3-letter ISO 4217 format.",""],
"awards-documents":["","All documents and attachments related to the award, including any notices.",""],
"awards-documents":["","Links to, or descriptions of, external documents can be attached at various locations within the standard. Documents may be supporting information, formal notices, downloadable forms, or any other kind of resource that should be made public as part of full open contracting.",""],
"awards-documents-id":["","A local, unique identifier for this document. This field is used to keep track of multiple revisions of a document through the compilation from release to record mechanism.",""],
"awards-documents-documentType":["","A classification of the document described taken from the documentType codelist. Values from the provided codelist should be used wherever possible, though extended values can be provided if the codelist does not have a relevant code.",""],
"awards-documents-title":["","The document title.",""],
"awards-documents-description":["","A short description of the document. We recommend descriptions do not exceed 250 words. In the event the document is not accessible online, the description field can be used to describe arrangements for obtaining a copy of the document.",""],
"awards-documents-url":["","direct link to the document or attachment. The server providing access to this document should be configured to correctly report the document mime type.",""],
"awards-documents-datePublished":["","The date on which the document was first published. This is particularly important for legally important documents such as notices of a tender.",""],
"awards-documents-dateModified":["","Date that the document was last modified",""],
"awards-documents-format":["","The format of the document taken from the IANA Media Types code list, with the addition of one extra value for 'offline/print', used when this document entry is being used to describe the offline publication of a document. Use values from the template column. Links to web pages should be tagged 'text/html'.",""],
"awards-documents-language":["","Specifies the language of the linked document using either two-digit ISO 639-1, or extended BCP47 language tags. The use of two-letter codes from ISO 639-1 is strongly recommended unless there is a clear user need for distinguishing the language subtype.",""],
"awards-amendments":["","An award amendment is a formal change to the details of the award, and generally involves the publication of a new award notice/release. The rationale and a description of the changes made can be provided here.",""],
"awards-amendments-id":["","An identifier for this amendment: often the amendment number",""],
"awards-amendments-date":["","The data of this amendment.",""],
"awards-amendments-description":["","A free text, or semi-structured, description of the changes made in this amendment.",""],
"awards-amendments-amendsReleaseID":["","Provide the identifier (release.id) of the OCDS release (from this contracting process) that provides the values for this contracting process before the amendment was made.",""],
"awards-amendments-releaseID":["","Provide the identifier (release.id) of the OCDS release (from this contracting process) that provides the values for this contracting process after the amendment was made.",""],
"awards-amendments-rationale":["","An explanation for the amendment.",""],
"contracts":["","Information from the contract creation phase of the procurement process.",""],
"contracts":["","Information regarding the signed contract between the buyer and supplier(s).",""],
"contracts-id":["","The identifier for this contract. It must be unique and cannot change within its Open Contracting Process (defined by a single ocid). See the identifier guidance for further details.",""],
"contracts-awardID":["","The award.id against which this contract is being issued.",""],
"contracts-title":["","Contract title",""],
"contracts-description":["","Contract description",""],
"contracts-status":["","The current status of the contract. Drawn from the contractStatus codelist",""],
"contracts-period":["","The start and end date for the contract",""],
"contracts-period-startDate":["","The start date for the period.",""],
"contracts-period-endDate":["","The end date for the period.",""],
"contracts-period-durationInDays":["","The period cannot be extended beyond this date. This field is optional, and can be used to express the maximum available data for extension or renewal of this period.",""],
"contracts-period-maxExtentDate":["","The maximum duration of this period in days. A user interface may wish to collect or display this data in months or years as appropriate, but should convert it into days when completing this field. This field can be used when exact dates are not known. Where a startDate and endDate are given, this field is optional, and should reflect the difference between those two days. Where a startDate and maxExtentDate are given, this field is optional, and should reflect the diffence between startDate and maxExtentDate.",""],
"contracts-dateSigned":["","The date the contract was signed. In the case of multiple signatures, the date of the last signature.",""],
"contracts-value":["","The total value of this contract. A negative value indicates that the contract will involve payments from the supplier to the buyer (commonly used in concession contracts).",""],
"contracts-value-amount":["","Amount as a number.",""],
"contracts-value-currency":["","The currency in 3-letter ISO 4217 format.",""],
"contracts-items":["","The goods, services, and any intangible outcomes in this contract. Note: If the items are the same as the award do not repeat.",""],
"contracts-items-id":["","A local identifier to reference and merge the items by. Must be unique within a given array of items.",""],
"contracts-items-description":["","A description of the goods, services to be provided.",""],
"contracts-items-classification":["","The primary classification for the item. See the itemClassificationScheme to identify preferred classification lists, including CPV and GSIN.",""],
"contracts-items-classification-scheme":["","An classification should be drawn from an existing scheme or list of codes. This field is used to indicate the scheme/codelist from which the classification is drawn. For line item classifications, this value should represent an known Item Classification Scheme wherever possible.",""],
"contracts-items-classification-id":["","The classification code drawn from the selected scheme.",""],
"contracts-items-classification-description":["","A textual description or title for the code.",""],
"contracts-items-classification-uri":["","A URI to identify the code. In the event individual URIs are not available for items in the identifier scheme this value should be left blank.",""],
"contracts-items-additionalClassifications":["","An array of additional classifications for the item. See the itemClassificationScheme codelist for common options to use in OCDS. This may also be used to present codes from an internal classification scheme.",""],
"contracts-items-additionalClassifications-scheme":["","An classification should be drawn from an existing scheme or list of codes. This field is used to indicate the scheme/codelist from which the classification is drawn. For line item classifications, this value should represent an known Item Classification Scheme wherever possible.",""],
"contracts-items-additionalClassifications-id":["","The classification code drawn from the selected scheme.",""],
"contracts-items-additionalClassifications-description":["","A textual description or title for the code.",""],
"contracts-items-additionalClassifications-uri":["","A URI to identify the code. In the event individual URIs are not available for items in the identifier scheme this value should be left blank.",""],
"contracts-items-quantity":["","The number of units required",""],
"contracts-items-unit":["","Description of the unit which the good comes in e.g. hours, kilograms. Made up of a unit name, and the value of a single unit.",""],
"contracts-items-unit-name":["","Name of the unit",""],
"contracts-items-unit-scheme":["","The list from which units of measure identifiers are taken. This should be an entry from the options available in the unitClassificationScheme codelist. Use of the scheme ‘UNCEFACT’ for the UN/CEFACT Recommendation 20 list of ‘Codes for Units of Measure Used in International Trade’ is recommended, although other options are available.",""],
"contracts-items-unit-id":["","The identifier from the codelist referenced in the scheme property. Check the codelist for details of how to find and use identifiers from the scheme in use.",""],
"contracts-items-unit-uri":["","If the scheme used provide a machine-readable URI for this unit of measure, this can be given.",""],
"contracts-items-unit-value":["","The monetary value of a single unit.",""],
"contracts-items-unit-value-amount":["","Amount as a number.",""],
"contracts-items-unit-value-currency":["","The currency in 3-letter ISO 4217 format.",""],
"contracts-milestones":["","A list of milestones associated with the finalisation of this contract.",""],
"contracts-milestones":["","",""],
"contracts-milestones-code":["","Milestone codes can be used to track specific events that take place for a particular kind of contracting process. For example, a code of 'approvalLetter' could be used to allow applications to understand this milestone represents the date an approvalLetter is due or signed. Milestone codes is an open codelist, and codes should be agreed amoungst data producers and the applications using that data.",""],
"contracts-milestones-dateMet":["","The date on which the milestone was met.",""],
"contracts-milestones-dateModified":["","The date the milestone was last reviewed or modified and the status was altered or confirmed to still be correct.",""],
"contracts-milestones-description":["","A description of the milestone.",""],
"contracts-milestones-documents":["","Links to, or descriptions of, external documents can be attached at various locations within the standard. Documents may be supporting information, formal notices, downloadable forms, or any other kind of resource that should be made public as part of full open contracting.",""],
"contracts-milestones-dueDate":["","The date the milestone is due.",""],
"contracts-milestones-id":["","A local identifier for this milestone, unique within this block. This field is used to keep track of multiple revisions of a milestone through the compilation from release to record mechanism.",""],
"contracts-milestones-status":["","The status that was realized on the date provided in dateModified, drawn from the milestoneStatus codelist.",""],
"contracts-milestones-title":["","Milestone title",""],
"contracts-milestones-type":["","The type of milestone, drawn from an extended milestoneType codelist.",""],
"contracts-documents":["","All documents and attachments related to the contract, including any notices.",""],
"contracts-documents":["","Links to, or descriptions of, external documents can be attached at various locations within the standard. Documents may be supporting information, formal notices, downloadable forms, or any other kind of resource that should be made public as part of full open contracting.",""],
"contracts-documents-id":["","A local, unique identifier for this document. This field is used to keep track of multiple revisions of a document through the compilation from release to record mechanism.",""],
"contracts-documents-documentType":["","A classification of the document described taken from the documentType codelist. Values from the provided codelist should be used wherever possible, though extended values can be provided if the codelist does not have a relevant code.",""],
"contracts-documents-title":["","The document title.",""],
"contracts-documents-description":["","A short description of the document. We recommend descriptions do not exceed 250 words. In the event the document is not accessible online, the description field can be used to describe arrangements for obtaining a copy of the document.",""],
"contracts-documents-url":["","direct link to the document or attachment. The server providing access to this document should be configured to correctly report the document mime type.",""],
"contracts-documents-datePublished":["","The date on which the document was first published. This is particularly important for legally important documents such as notices of a tender.",""],
"contracts-documents-dateModified":["","Date that the document was last modified",""],
"contracts-documents-format":["","The format of the document taken from the IANA Media Types code list, with the addition of one extra value for 'offline/print', used when this document entry is being used to describe the offline publication of a document. Use values from the template column. Links to web pages should be tagged 'text/html'.",""],
"contracts-documents-language":["","Specifies the language of the linked document using either two-digit ISO 639-1, or extended BCP47 language tags. The use of two-letter codes from ISO 639-1 is strongly recommended unless there is a clear user need for distinguishing the language subtype.",""],
"contracts-amendments":["","A contract amendment is a formal change to, or extension of, a contract, and generally involves the publication of a new contract notice/release, or some other documents detailing the change. The rationale and a description of the changes made can be provided here.",""],
"contracts-amendments-id":["","An identifier for this amendment: often the amendment number",""],
"contracts-amendments-date":["","The data of this amendment.",""],
"contracts-amendments-description":["","A free text, or semi-structured, description of the changes made in this amendment.",""],
"contracts-amendments-amendsReleaseID":["","Provide the identifier (release.id) of the OCDS release (from this contracting process) that provides the values for this contracting process before the amendment was made.",""],
"contracts-amendments-releaseID":["","Provide the identifier (release.id) of the OCDS release (from this contracting process) that provides the values for this contracting process after the amendment was made.",""],
"contracts-amendments-rationale":["","An explanation for the amendment.",""],
"contracts-relatedProcess":["","The relatedProcess block can be used to cross-reference between the relevant open contracting processes using their OCID",""],
"contracts-relatedProcesses-id":["","A local identifier for this relationship, unique within this array.",""],
"contracts-relatedProcesses-relationship":["","Specify the type of relationship using the related process codelist.",""],
"contracts-relatedProcesses-title":["","The title of the related process, where referencing an open contracting process, this field should match the tender/title field in the related process.",""],
"contracts-relatedProcesses-scheme":["","The identification scheme used by this cross-reference from the related process scheme codelist codelist. When cross-referencing information also published using OCDS, an Open Contracting ID (ocid) should be used.",""],
"contracts-relatedProcesses-identifier":["","The identifier of the related process. When cross-referencing information also published using OCDS, this should be the Open Contracting ID (ocid).",""],
"contracts-relatedProcesses-uri":["","A URI pointing to a machine-readble document, release or record package containing the identified related process.",""],
"contracts-implementation":["","Information during the performance / implementation stage of the contract.",""],
"contracts-implementation-transactions":["","A list of the spending transactions made against this contract",""],
"contracts-implementation-transactions":["","A spending transaction related to the contracting process. Draws upon the data models of the [Budget Data Package](https://github.com/openspending/budget-data-package/blob/master/specification.md) and the [International Aid Transpareny Initiative](http://iatistandard.org/activity-standard/iati-activities/iati-activity/transaction/) and should be used to cross-reference to more detailed information held using a Budget Data Package, IATI file, or to provide enough information to allow a user to manually or automatically cross-reference with some other published source of transactional spending data.",""],
"contracts-implementation-transactions-id":["","A unique identifier for this transaction. This identifier should be possible to cross-reference against the provided data source. For the budget data package this is the id, for IATI, the transaction reference.",""],
"contracts-implementation-transactions-source":["","Used to point either to a corresponding Budget Data Package, IATI file, or machine or human-readable source where users can find further information on the budget line item identifiers, or project identifiers, provided here.",""],
"contracts-implementation-transactions-date":["","The date of the transaction",""],
"contracts-implementation-transactions-value":["","The value of the transaction",""],
"contracts-implementation-transactions-value-amount":["","Amount as a number.",""],
"contracts-implementation-transactions-value-currency":["","The currency in 3-letter ISO 4217 format.",""],
"contracts-implementation-transactions-payer":["","An organization reference for the organization from which the funds in this transaction originate.",""],
"contracts-implementation-transactions-payer-name":["","name field that repeats the name given in the parties section, provided for the convenience of users viewing the data, and to support detection of mistakes in cross-referencing",""],
"contracts-implementation-transactions-payer-id":["","id used to cross-reference the entry in the parties section that contains full information on this organization or entity",""],
"contracts-implementation-transactions-payer-identifier":["","",""],
"contracts-implementation-transactions-payer-identifier-id":["","The identifier of the organization in the selected scheme.",""],
"contracts-implementation-transactions-payer-identifier-scheme":["","Organization identifiers be drawn from an existing identification scheme. This field is used to indicate the scheme or codelist in which the identifier will be found. This value should be drawn from the Organization Identifier Scheme.",""],
"contracts-implementation-transactions-payer-identifier-legalName":["","The legally registered name of the organization.",""],
"contracts-implementation-transactions-payer-identifier-uri":["","A URI to identify the organization, such as those provided by Open Corporates or some other relevant URI provider. This is not for listing the website of the organization: that can be done through the url field of the Organization contact point.",""],
"contracts-implementation-transactions-payee":["","An organization reference for the organization which receives the funds in this transaction.",""],
"contracts-implementation-transactions-payee-name":["","name field that repeats the name given in the parties section, provided for the convenience of users viewing the data, and to support detection of mistakes in cross-referencing",""],
"contracts-implementation-transactions-payee-id":["","id used to cross-reference the entry in the parties section that contains full information on this organization or entity",""],
"contracts-implementation-transactions-payee-identifier":["","",""],
"contracts-implementation-transactions-payee-identifier-id":["","The identifier of the organization in the selected scheme.",""],
"contracts-implementation-transactions-payee-identifier-scheme":["","Organization identifiers be drawn from an existing identification scheme. This field is used to indicate the scheme or codelist in which the identifier will be found. This value should be drawn from the Organization Identifier Scheme.",""],
"contracts-implementation-transactions-payee-identifier-legalName":["","The legally registered name of the organization.",""],
"contracts-implementation-transactions-payee-identifier-uri":["","A URI to identify the organization, such as those provided by Open Corporates or some other relevant URI provider. This is not for listing the website of the organization: that can be done through the url field of the Organization contact point.",""],
"contracts-implementation-transactions-uri":["","A URI pointing directly to a machine-readable record about this spending transaction.",""],
"contracts-implementation-milestones":["","As milestones are completed, milestone completions should be documented.",""],
"contracts-implementation-milestones-id":["","A local identifier for this milestone, unique within this block. This field is used to keep track of multiple revisions of a milestone through the compilation from release to record mechanism.",""],
"contracts-implementation-milestones-title":["","Milestone title",""],
"contracts-implementation-milestones-type":["","The type of milestone, drawn from an extended milestoneType codelist.",""],
"contracts-implementation-milestones-description":["","A description of the milestone.",""],
"contracts-implementation-milestones-code":["","Milestone codes can be used to track specific events that take place for a particular kind of contracting process. For example, a code of ‘approvalLetter’ could be used to allow applications to understand this milestone represents the date an approvalLetter is due or signed. Milestone codes is an open codelist, and codes should be agreed amoungst data producers and the applications using that data.",""],
"contracts-implementation-milestones-dueDate":["","The date the milestone is due.",""],
"contracts-implementation-milestones-dateMet":[""," The date on which the milestone was met.",""],
"contracts-implementation-milestones-dateModified":["","The date the milestone was last reviewed or modified and the status was altered or confirmed to still be correct.",""],
"contracts-implementation-milestones-status":["","The status that was realized on the date provided in dateModified, drawn from the milestoneStatus codelist.",""],
"contracts-implementation-documents":["","Documents and reports that are part of the implementation phase e.g. audit and evaluation reports.",""],
"contracts-implementation-documents":["","Links to, or descriptions of, external documents can be attached at various locations within the standard. Documents may be supporting information, formal notices, downloadable forms, or any other kind of resource that should be made public as part of full open contracting.",""],
"contracts-implementation-documents-id":["","A local, unique identifier for this document. This field is used to keep track of multiple revisions of a document through the compilation from release to record mechanism.",""],
"contracts-implementation-documents-documentType":["","A classification of the document described taken from the documentType codelist. Values from the provided codelist should be used wherever possible, though extended values can be provided if the codelist does not have a relevant code.",""],
"contracts-implementation-documents-title":["","The document title.",""],
"contracts-implementation-documents-description":["","A short description of the document. We recommend descriptions do not exceed 250 words. In the event the document is not accessible online, the description field can be used to describe arrangements for obtaining a copy of the document.",""],
"contracts-implementation-documents-url":["","direct link to the document or attachment. The server providing access to this document should be configured to correctly report the document mime type.",""],
"contracts-implementation-documents-datePublished":["","The date on which the document was first published. This is particularly important for legally important documents such as notices of a tender.",""],
"contracts-implementation-documents-dateModified":["","Date that the document was last modified",""],
"contracts-implementation-documents-format":["","The format of the document taken from the IANA Media Types code list, with the addition of one extra value for 'offline/print', used when this document entry is being used to describe the offline publication of a document. Use values from the template column. Links to web pages should be tagged 'text/html'.",""],
"contracts-implementation-documents-language":["","Specifies the language of the linked document using either two-digit ISO 639-1, or extended BCP47 language tags. The use of two-letter codes from ISO 639-1 is strongly recommended unless there is a clear user need for distinguishing the language subtype.",""]
}
